experimental_cases/OF9/disengagement/bubble_column_pbe_20L/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default                     none;

    "div\(phi,alpha.*\)"              Gauss vanLeer;

    "div\(phir,alpha.*,alpha.*\)"       Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"          Gauss limitedLinearV 1;
    "div\(phi.*,U.*\)"                  Gauss limitedLinearV 1;
    "div\(alphaRhoPhi.*,Yi\)"       Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,(h|e).*\)"          Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,(K|k|epsilon|omega).*\)"          Gauss limitedLinear 1;
    "div\(alphaPhi.*,f.*\)"         Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,\(p\|thermo:rho.*\)\)"    Gauss limitedLinear 1;

    "div\(phim,(k|epsilon)m\)"      Gauss upwind;
    "div\(\(\(\(alpha.*\*thermo:rho.*\)*nuEff.*\)*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

wallDist
{
    method          Poisson;
    nRequired       true;
}


// ************************************************************************* //
